app/controllers/organizations_controller.rb

SELECT  "organizations".* FROM "organizations" LIMIT 1
---
  def index
    @organizations = Organization.all

INSERT INTO "organizations" ("name", "contact_name", "contact_mail", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    Organization.create!(
      name:         params[:organization][:name],
      contact_name: params[:organization][:contact_name],
      contact_mail: params[:organization][:contact_mail]
    )

UPDATE "organizations" SET "name" = ?, "contact_name" = ?, "contact_mail" = ?, "updated_at" = ? WHERE "organizations"."id" = ?  [["name", "Mraz LLC"], ["contact_name", "Dylan Ziemann DDS"], ["contact_mail", "ziemann.dds.dylan@ruel.info"], ["updated_at", "2015-08-31 04:26:46.305959"], ["id", 1]]
---
  def update
    Organization.update(
      params[:id],
      params.require(:organization)
      .permit(:name, :contact_name, :contact_mail)
    )

DELETE FROM "organizations" WHERE "organizations"."id" = ?  [["id", 1]]
---
  def destroy
    Organization.delete params[:id]