app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT  "users".* FROM "users" LIMIT 1

  def create
    User.create(params.require(:user)
        .permit(:login, :password, :email, :website))
---
INSERT INTO "users" ("login", "password", "email", "website", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["login", "new"], ["password", "password"], ["email", "email@email.com"], ["website", "website.com"], ["created_at", "2015-09-02 02:14:32.049845"], ["updated_at", "2015-09-02 02:14:32.049845"]]

  def destroy
    @user.delete
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]

  def update
    user = params.require(:user).permit(:login, :password)
    @user.update_attributes(user)
---
UPDATE "users" SET "password" = ?, "login" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "y"], ["login", "x"], ["updated_at", "2015-09-01 01:18:43.901818"], ["id", 1]]