app/controllers/welcome_controller.rb

  def index
    redirect_to dashboard_path if User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]